# HARSHAVARDHAN S V

# 20BCS040

In [1]:
import pandas as pd

In [8]:
data = pd.read_csv("Customers.csv")

In [14]:
data.shape

(2000, 8)

In [15]:
data

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [16]:
len(data.Profession.value_counts())

9

In [13]:
data.isna().sum()

CustomerID                 0
Gender                     0
Age                        0
Annual Income ($)          0
Spending Score (1-100)     0
Profession                35
Work Experience            0
Family Size                0
dtype: int64

In [25]:
data = data.drop(data[data["Profession"].isna()].index)

In [26]:
data.isna().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income ($)         0
Spending Score (1-100)    0
Profession                0
Work Experience           0
Family Size               0
dtype: int64

In [29]:
data = data.drop(columns = ["CustomerID","bvdsv","nnn"],axis = 1)

In [30]:
data

,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,Male,19,15000,39,Healthcare,1,4
1,Male,21,35000,81,Engineer,3,3
2,Female,20,86000,6,Engineer,1,1
3,Female,23,59000,77,Lawyer,0,2
4,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...
1995,Female,71,184387,40,Artist,8,7
1996,Female,91,73158,32,Doctor,7,7
1997,Male,87,90961,14,Healthcare,9,2
1998,Male,77,182109,4,Executive,7,2
1999,Male,90,110610,52,Entertainment,5,2

In [28]:
from sklearn import preprocessing
  
label_encoder = preprocessing.LabelEncoder()

In [31]:


data['Gender']= label_encoder.fit_transform(data['Gender'])

In [32]:
data

,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,19,15000,39,Healthcare,1,4
1,1,21,35000,81,Engineer,3,3
2,0,20,86000,6,Engineer,1,1
3,0,23,59000,77,Lawyer,0,2
4,0,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...
1995,0,71,184387,40,Artist,8,7
1996,0,91,73158,32,Doctor,7,7
1997,1,87,90961,14,Healthcare,9,2
1998,1,77,182109,4,Executive,7,2
1999,1,90,110610,52,Entertainment,5,2

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1965 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Gender                  1965 non-null   int32
 1   Age                     1965 non-null   int64
 2   Annual Income ($)       1965 non-null   int64
 3   Spending Score (1-100)  1965 non-null   int64
 4   Profession              1965 non-null   object
 5   Work Experience         1965 non-null   int64
 6   Family Size             1965 non-null   int64
dtypes: int32(1), int64(5), object(1)
memory usage: 115.1+ KB

# Decision Tree

In [34]:
from sklearn.model_selection import train_test_split

In [35]:
from sklearn.tree import DecisionTreeClassifier

In [45]:

from sklearn.datasets import make_classification
from sklearn import tree

In [38]:
X = data.drop(columns = ["Profession"],axis = 1)
y = data["Profession"]

In [39]:
X_train, X_test, t_train, t_test = train_test_split( X, y, test_size=0.3)

In [46]:
model = tree.DecisionTreeClassifier()

model = model.fit(X_train, t_train)

In [103]:
predicted_value = model.predict(X_test)

In [89]:
accuracy = accuracy_score(t_test, predicted_value)

In [92]:
accuracy

1.0

# naive bayes

In [93]:
from sklearn.naive_bayes import GaussianNB

In [95]:
model = GaussianNB()

In [96]:
model = model.fit(X_train, t_train)

In [97]:
predicted_value = model.predict(X_test)

In [99]:
accuracy = accuracy_score(t_test, predicted_value)

In [102]:
accuracy

0.8